[
{"month":"Jan","day":1,"Ayah":"O you who believe! Obey Allah and obey the Apostle, and make not vain your deeds! Al-Quran 47: 33","islamicDay":"10"},
{"month":"Jan","day":2,"Ayah":"To Allah belong the unseen secrets of the heavens and the earth, and to Him goes back every affair (for decision): Then worship Him, and put your trust in Him: And your Lord is not unmindful of ought that you do. Al-Quran 11: 123","islamicDay":"11"},
{"month":"Jan","day":3,"Ayah":"To each is a goal to which Allah turns him; then strive together (as in a race) towards all that is good! Al-Quran 2: 148","islamicDay":"12"},
{"month":"Jan","day":4,"Ayah":"Verily, never will Allah change the condition of the people until they change it themselves (with their souls. Al-Quran 13: 11","islamicDay":"13"},
{"month":"Jan","day":5,"Ayah":"Whatever good, (O man!) happens to you, is from Allah; but whatever evil happens to you, is from yourself and We have sent you as an Apostle to (instruct) mankind. And enough is Allah for a witness. Al- Quran 4: 79","islamicDay":"14"},
{"month":"Jan","day":6,"Ayah":"Invite (all) to the way of your Lord with wisdom and beautiful preaching; and argue with them in ways that are best and most gracious. Al-Quran 16: 125","islamicDay":"15"},
{"month":"Jan","day":7,"Ayah":"See not how Allah sets forth a parable? A Goodly Word like a Goodly tree, whose root is firmly fixed, and it’s branches (reach) to the heavens. Al-Quran 14: 24","islamicDay":"16"},
{"month":"Jan","day":8,"Ayah":"And the earth We have spread out (like a carpet) set thereon mountains firm and immovable; and produced therein all kinds of things in due balance. Al-Quran 15: 19","islamicDay":"17"},
{"month":"Jan","day":9,"Ayah":"seest you not that Allah sends down rain from the sky, and forthwith the earth becomes clothed with green? For Allah is He Who understands the finest mysteries, and is well-acquainted (with them). Al-Quran 22: 63","islamicDay":"18"},
{"month":"Jan","day":10,"Ayah":"And the parable of an evil word is that of an evil tree: it is torn up by the root from the surface of the earth: it has no stability. Al-Quran 14: 26","islamicDay":"19"},
{"month":"Jan","day":11,"Ayah":"Behold! Verily on the friends of Allah there is no fear; nor shall they grieve. Al-Quran 10: 62","islamicDay":"20"},
{"month":"Jan","day":12,"Ayah":"It is Allah who creates you and takes your soul at death; and of you there are some who are sent back to a feeble age, so that they know nothing after having known (much. For Allah is All-Knowing, All-Powerful. Al-Quran 16: 70","islamicDay":"21"},
{"month":"Jan","day":13,"Ayah":"It is Allah who sends down rain from the sky: from it you drink, and out of it (grows) the vegetation on which you feed your cattle. Al-Quran 16: 10","islamicDay":"22"},
{"month":"Jan","day":14,"Ayah":"Whoever works righteousness, man or woman, and has faith, verily to them will We give a new life that is good and pure, and We will bestow on such their reward according to the best of their actions. Al-Quran 16: 97","islamicDay":"23"},
{"month":"Jan","day":15,"Ayah":"Allah commands justice, the doing of good, and liberality to kith and kin, and He forbids all shameful deeds, and injustice and rebellion. He instructs you that you may receive admonition. Al-Quran 16: 90","islamicDay":"24"},
{"month":"Jan","day":16,"Ayah":"Allah has made subject to you the Night and Day; the sun and the moon: and the stars are in subjection by His command. Verily in this are signs for men who are wise. Al-Quran 16: 12","islamicDay":"25"},
{"month":"Jan","day":17,"Ayah":"What is with you must vanish: what is with Allah will endure. And We will certainly bestow, on those who patiently persevere, their reward according to the best of their actions. Al-Quran 16: 96","islamicDay":"26"},
{"month":"Jan","day":18,"Ayah":"This is the Book, in it is guidance sure, without doubt; to those who fear Allah, who believe in the unseen, are steadfast in prayer, and spend out of what We have provided for them. Al-Quran 2: 2-3","islamicDay":"27"},
{"month":"Jan","day":19,"Ayah":"O you people! Adore your Guardian Lord, who created you and those who came before you, that you may have the chance to learn righteousness. Al-Quran 2: 21","islamicDay":"28"},
{"month":"Jan","day":20,"Ayah":"And cover not Truth with falsehood, not conceal the Truth when you know (what it is). Al-Quran 2: 42","islamicDay":"29"},
{"month":"Jan","day":21,"Ayah":"Treat with kindness your parents and kindred, and orphans and those in need; speak fair to the people, be steadfast in prayer and practice regular charity. Al-Quran 2: 83","islamicDay":"30"},
{"month":"Jan","day":22,"Ayah":"And if you are in doubt as to what We have revealed from time to time to Our servant, then produce a Sura like thereunto and call your witnesses or helpers besides Allah. Al-Quran 2: 23","islamicDay":"1"},
{"month":"Jan","day":23,"Ayah":"And recite (and teach) what has been revealed to you of the Book of your Lord; none can change His words, and none will you find as a refuge other than Him. Al-Quran","islamicDay":"2"},
{"month":"Jan","day":24,"Ayah":"Nor say of anything - I shall be sure to do so and so tomorrow – without addling: So please Allah! And call your Lord to mind when you forget, and say – I hope that my Lord will guide me ever closer than this to the right road. Al-Quran 18: 23-24","islamicDay":"3"},
{"month":"Jan","day":25,"Ayah":"Blessed is He who made constellations in the skies, and placed therein a Lamp and a moon giving Light. Al-Quran 25: 61","islamicDay":"4"},
{"month":"Jan","day":26,"Ayah":"So lose not heart nor fall into despair; for you must gain mastery if you are true in faith. Al-Quran 3: 139","islamicDay":"5"},
{"month":"Jan","day":27,"Ayah":"Kind words and covering of faults are better than charity followed by injury. Allah is free of all wants, and He is Most-Forbearing. Al-Quran 2: 263","islamicDay":"6"},
{"month":"Jan","day":28,"Ayah":"The good deed and the evil deed are not alike. Repel the evil deed with the one that is better, than lo, he with whom you shared enmity (will become) as though he was a bosom friend. Al-Quran 41: 34","islamicDay":"7"},
{"month":"Jan","day":29,"Ayah":"O you that believe! Betray not the trust of Allah and the Apostle, nor misappropriate knowingly things entrusted to you. Al-Quran 8: 27","islamicDay":"8"},
{"month":"Jan","day":30,"Ayah":"Allah! There is god but He, the Living, the Self-subsisting, Eternal. No slumber can seize Him nor sleep. His are all things in the heavens and on earth. Who is there can intercede in His presence except as He permits?","islamicDay":"9"},
{"month":"Jan","day":31,"Ayah":"Those who believe in the Quran and those who follow the Jewish Scriptures, and the Christians and the Sabians - any who believe in Allah and the Last Day and work righteousness shall have their reward with their Lord: on them shall be no fear, nor shall they grieve. Al-Quran 2: 62","islamicDay":"10"},
{"month":"Feb","day":3,"Ayah":"Behold! On the Creation of the heavens and the earth, and the alternation of night and day, there are indeed signs for men of understanding. Al-Quran 3: 190","islamicDay":"13"},
{"month":"Feb","day":4,"Ayah":"Those who believe and (constantly) guard against evil; for them are glad tidings in the life of the present and in the hereafter: no change can there be in the words of Allah. This indeed is the Supreme Felicity. A-Quran 10: 63-64","islamicDay":"14"},
{"month":"Feb","day":5,"Ayah":"Whoever recommends and helps a good cause becomes a partner therein: and whoever recommends and helps an evil cause, shares in its burden. And Allah has power over all things. Al-Quran 4: 85","islamicDay":"15"},
{"month":"Feb","day":3,"Ayah":"Behold! On the Creation of the heavens and the earth, and the alternation of night and day, there are indeed signs for men of understanding. Al-Quran 3: 190","islamicDay":"13"},
{"month":"Feb","day":4,"Ayah":"Those who believe and (constantly) guard against evil; for them are glad tidings in the life of the present and in the hereafter: no change can there be in the words of Allah. This indeed is the Supreme Felicity. A-Quran 10: 63-64","islamicDay":"14"},
{"month":"Feb","day":5,"Ayah":"O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise each other). Verily the most honoured of you in the sight of Allah is (he who is) the most righteous of you. And Allah has full knowledge and is well aquainted with all things.","islamicDay":"15"},
{"month":"Feb","day":6,"Ayah":"O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise each other). Verily the most honoured of you in the sight of Allah is (he who is) the most righteous of you. And Allah has full knowledge and is well aquainted with all things.","islamicDay":"16"},
{"month":"Feb","day":7,"Ayah":"And establish regular prayers at the two ends of the day and at the approaches to the night: for those things that are good remove those that are evil. Al-Quran 11: 114","islamicDay":"17"},
{"month":"Feb","day":8,"Ayah":"And He is Allah in the heavens and on earth. He knows what you hide, and what you reveal. And He knows the (recompense) which you earn (by your) deeds. Al-Quran 6: 3","islamicDay":"18"},
{"month":"Feb","day":9,"Ayah":"And hold fast, altogether, by the rope which Allah stretches out to you, and be not divided among yourselves; and remember with gratitude Allah’s favor on you. Al-Quran 3: 103","islamicDay":"19"},
{"month":"Feb","day":10,"Ayah":"And your God is One God: There is no God but He, Most Gracious, Most Merciful. Al-Quran 2: 163","islamicDay":"20"},
{"month":"Feb","day":11,"Ayah":"Whatever is in the heavens and on earth, does declare the praises and Glory of Allah. To Him belongs the Dominion, and to Him belongs the Praise: and He has power over all things. Al-Quran 64: 1","islamicDay":"21"},
{"month":"Feb","day":12,"Ayah":"It is Allah who has created you; and of you are some that are unbelievers, and some that are believers: and Allah sees well all that you do. Al-Quran 64: 2","islamicDay":"22"},
{"month":"Feb","day":13,"Ayah":"Allah knows the unseen and that which is open: He is the Great, the most High. Al-Quran 13: 9","islamicDay":"23"},
{"month":"Feb","day":14,"Ayah":"Say: I seeks refuge with the Lord and Cherisher of Mankind, the King of Mankind, the God of Mankind. From the mischief of the whisperer of evil who withdraws after his whisper. Al-Quran 114: 1- 4","islamicDay":"24"},
{"month":"Feb","day":15,"Ayah":"Who is he that will loan to Allah a beautiful loan: For Allah will increase it manifold to his credit and he will have besides a liberal rewards. Al-Quran 57: 11","islamicDay":"25"},
{"month":"Feb","day":16,"Ayah":"To Allah belongs all that is in the heavens and on earth. Whether you show what is in your minds or conceal it; Allah calls you to account for it. Al-Quran 2: 284","islamicDay":"26"},
{"month":"Feb","day":17,"Ayah":"Your Lord has decreed that you worship none but Him. And that you be kind to parents whether one or both of them attain old age in your life, say not to them a word of contempt, nor repel them, but address them, in terms of honor. Al-Quran 17: 23","islamicDay":"27"},
{"month":"Feb","day":18,"Ayah":"And the likeness of those who spend their substance, seeking to please Allah and strengthen their souls, is as a garden, high and fertile heavy rains fall on it, but makes it yield a double increase of harvest. Al-Quran 2: 265","islamicDay":"28"},
{"month":"Feb","day":19,"Ayah":"For each such person there are angels in succession, before and behind him: they guard him by the command of Allah. Verily never will Allah change the condition of a people until they change it themselves. Al-Quran 13: 11","islamicDay":"29"},
{"month":"Feb","day":20,"Ayah":"But verily, your Lord, to those who do wrong in ignorance, but who thereafter repent and make amends, your Lord, after all this, if Oft-Forgiving, Most Merciful. Al-Quran 16: 119","islamicDay":"1"},
{"month":"Feb","day":21,"Ayah":"Read, therefore as much of the Quran as may be easy for you and establish regular Prayer and give regular Charity; and loan to Allah a beautiful loan. Al-Quran 73: 20","islamicDay":"2"},
{"month":"Feb","day":22,"Ayah":"Your Lord knows best what is in your hearts: If you do deeds of righteousness, verily He is Most Forgiving to those who turn to Him again and again in true penitence. Al-Quran 17: 25","islamicDay":"3"},
{"month":"Feb","day":23,"Ayah":"So eat of the sustenance which Allah has provided for you, lawful and good: and be grateful for the favors of Allah, if it is He whom you serve. Al-Quran 16: 114","islamicDay":"4"},
{"month":"Feb","day":24,"Ayah":"Do they not look at the birds, held poised in the midst of the air and the sky? Nothing holds them up but the power of Allah. Verily, in this are signs for those who believe. Al-Quran 16: 79","islamicDay":"5"},
{"month":"Feb","day":25,"Ayah":"This Quran is not such as can be produced by other than Allah; on the contrary it is a confirmation of revelations that went before it. Al-Quran 10: 37","islamicDay":"6"},
{"month":"Feb","day":26,"Ayah":"O you who believe! Obey Allah and obey the Apostle and those charged with authority among you. If you differ in anything among yourselves, refer it to Allah and His Apostle. Al-Quran 4: 59","islamicDay":"7"},
{"month":"Feb","day":27,"Ayah":"And the earth We have spread it out, and set thereon mountains standing firm, and produced therein every kind of beautiful growth in pairs. Al-Quran 50: 7-8","islamicDay":"8"},
{"month":"Feb","day":28,"Ayah":"And render to the kindred their due rights, as also to those in want, and to the wayfarer: but squander not your wealth in the manner of a spendthrift. Al-Quran 17: 26","islamicDay":"9"},
{"month":"Mar","day":1,"Ayah":"And say to the believing men that they should lower their gaze and guard their modesty: that will make for greater purity for them: and Allah is well acquainted will all that you do. Al-Quran 24: 30","islamicDay":"10"},
{"month":"Mar","day":2,"Ayah":"When a courteous greetings is offered, you meet it with a greeting still more courteous, or at least of equal courtesy, Allah takes careful account of all things. Al-Quran 4: 86","islamicDay":"11"},
{"month":"Mar","day":3,"Ayah":"There is no compulsion in religion, truth stands out clear from error. Whoever rejects evil and believes in Allah has grasped the most trustworthy handhold that never breaks. And Allah hears and knows all things. Al-Quran 2: 256","islamicDay":"12"},
{"month":"Mar","day":4,"Ayah":"By the Glorious Morning Light, and by the Night when it is still, your Guardian Lord has not forsaken you, nor is He displeased. And verily the hereafter will be better for you than the present. Al-Quran 93: 1-4","islamicDay":"13"},
{"month":"Mar","day":5,"Ayah":"Whatever is in the heavens and on earth, let it declare the praises and Glory of Allah for He is the Exalted in Might, the Wise. Al-Quran 61: 1","islamicDay":"14"},
{"month":"Mar","day":6,"Ayah":"The parable of those who spend their substance in the way of Allah is that of a grain of corn; it grows seven ears, and each ear has a hundred grains; Allah gives manifold increase to whom He pleases. Al-Quran 2: 261","islamicDay":"15"},
{"month":"Mar","day":7,"Ayah":"When comes the help of Allah and victory and you see the people enter Allah’s Religion in crowds, celebrate the Praises of your Lord, and pray for His Forgiveness. For He is Oft Returning (in Grace and Mercy). Al-Quran 110: 1-3","islamicDay":"16"},
{"month":"Mar","day":8,"Ayah":"He who obeys the Messenger, obeys Allah. But if any turn away, We have not sent you to watch over their (evil deeds). Al-Quran 4: 80","islamicDay":"17"},
{"month":"Mar","day":9,"Ayah":"Allah is the Light of the Heavens and the earth. The parable of His Light is as if there were a Niche and within it a Lamp: the Lamp encloses in Glass; the glass as it were a brilliant star lit from a blessed tree. Al-Quran 24: 35","islamicDay":"18"},
{"month":"Mar","day":10,"Ayah":"And consult them in affairs of the moment then, when you have taken a decision, put your trust in Allah. For Allah loves those who put their trust in Him. Al-Quran 3: 159","islamicDay":"19"},
{"month":"Mar","day":11,"Ayah":"Allah! There is no god but He: of a surety He will gather you together against the Day of Judgment; about which there is no doubt. And whose word can be truer than Allah’s? Al-Quran4: 87","islamicDay":"20"},
{"month":"Mar","day":12,"Ayah":"Allah is the Protector of those who have faith. From the depth of darkness He will lead them forth into light. Al-Quran 2: 257","islamicDay":"21"},
{"month":"Mar","day":13,"Ayah":"Call on your Lord with humility and in private: for Allah loves not those who trespass beyond bounds. Al-Quran 7: 55","islamicDay":"22"},
{"month":"Mar","day":14,"Ayah":"It is He who created you; and of you are some that are unbelievers, and some that are believers: and Allah sees well all that you do. Al-Quran 64: 2","islamicDay":"23"},
{"month":"Mar","day":15,"Ayah":"By the token of time - through the ages -, verily man is in loss, except such as have faith and do righteous deeds and join together in mutual teaching of Truth, and of Patience and Constancy.","islamicDay":"24"},
{"month":"Mar","day":16,"Ayah":"And, out of kindness lower to parents the wing of humility, and say: - My Lord! Bestow on them your Mercy even as they cherished me in childhood. Al-Quran 17: 24","islamicDay":"25"},
{"month":"Mar","day":17,"Ayah":"O you who believe! Let not your riches or your children divert you from the remembrance of Allah. If any act thus, the loss is their own. Al-Quran 63: 9","islamicDay":"26"},
{"month":"Mar","day":18,"Ayah":"And whatever you spend in charity or devotion, be sure Allah knows it all. But the wrong doers have no helpers. Al-Quran 2: 270","islamicDay":"27"},
{"month":"Mar","day":19,"Ayah":"Blessed be He is whose hands is the Dominion; and He over all things has Power. He who creates death and life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft Forgiving. Al-Quran 67: 1-2","islamicDay":"28"},
{"month":"Mar","day":20,"Ayah":"As to those who believe and work righteousness, verily we shall not suffer to perish the reward of any who does a (single) righteous deed. Al-Quran 18: 30","islamicDay":"29"},
{"month":"Mar","day":21,"Ayah":"Say: He is Allah, the One and Only: Allah, the Eternal, Absolute; He begets not, nor is he begotten: and there is none like unto Him. Al-Quran 112: 1-4","islamicDay":"1"},
{"month":"Mar","day":22,"Ayah":"Allah loves not that evil should be noised abroad in public speech, except where injustice has been done; for Allah is He who hears and know all things. Al-Quran 4: 148","islamicDay":"2"},
{"month":"Mar","day":23,"Ayah":"It is He who has sent His Apostle with guidance and the Religion of Truth, that He may proclaim it over all religions, even though the pagans may detest it. Al-Quran 61: 9","islamicDay":"3"},
{"month":"Mar","day":24,"Ayah":"Those who break Allah’s Covenant after it is ratified, and who sunder what Allah has ordered to be joined, and do mischief on earth, these cause loss only to themselves. Al-Quran 2: 27","islamicDay":"4"},
{"month":"Mar","day":25,"Ayah":"Woe to every kind of scandal-monger and backbiter who piles up wealth and lays it by, thinking that his wealth would make last forever. Al-Quran 104: 1-3","islamicDay":"5"},
{"month":"Mar","day":26,"Ayah":"Say: I seek refuge with the Lord of the Dawn, from the mischief of created things, from the mischief of darkness as it overspreads; from the mischief of those who practice secret arts, and from the mischief of the envious one as he practices envy. Al-Quran 113: 1-5","islamicDay":"6"},
{"month":"Mar","day":27,"Ayah":"And be steadfast in prayer; practice regular charity: and bow down your heads with those who bow down (in worship). Al-Quran 2: 43","islamicDay":"7"},
{"month":"Mar","day":28,"Ayah":"In whatever business you may be, and whatever portion you may be reciting from the Quran, and whatever deed you (mankind) may be doing; We are witnessing thereof when you are engrossed therein. Al-Quran 10: 61","islamicDay":"8"},
{"month":"Mar","day":29,"Ayah":"Let the man of means spend according to his means: and the man whose resources are restricted, let him spend according to what Allay has given him. Allah puts no burden on any person beyond what He has given him. After a difficulty, Allah will soon grant relief. Al-Quran 65: 7","islamicDay":"9"},
{"month":"Mar","day":30,"Ayah":"It is Allah who has created for you all things that are on earth. Moreover His design comprehends the heavens; for He gave order and perfection to the seven firmaments; and of all things He has perfect knowledge. Al-Quran 2: 29","islamicDay":"10"},
{"month":"Mar","day":31,"Ayah":"And Allah provides for him from sources he never could imagine. And if anyone puts his trust in Allah, sufficient is Allah for him. For Allah will surely accomplish His purpose; verily for all things has Allah appointed a due proportions. Al-Quran 65: 3","islamicDay":"11"},
{"month":"Apr","day":1,"Ayah":"If you disclose (acts of) charity, even so it is well. But if you conceal them, and make them reach those (really) in need that is best for you: It will remove from you some of your (stains) of evil. And Allah is well acquainted with what you do. Al-Quran 2:271 ","islamicDay":"12"},
{"month":"Apr","day":2,"Ayah":"And be steadfast in patience, for verily Allah will not suffer the reward of the righteous to perish. Al-Quran 11:115 ","islamicDay":"13"},
{"month":"Apr","day":3,"Ayah":"Allah it is that has made you the night that you may rest therein, and the day to make you things visible (to you). Verily in this are signs for those who listen (to His Message. Al-Quran 10: 67","islamicDay":"14"},
{"month":"Apr","day":4,"Ayah":"Let there arise out of you a band of people inviting to all that is good, enjoining what is right, and forbidding what is wrong: They are the ones to attain felicity. Al-Quran 3:104","islamicDay":"15"},
{"month":"Apr","day":5,"Ayah":"It is Allah who has spread out the earth for (His) creatures: therein is fruit and date-palms, producing spathes (enclosing dates):  Also corn, with its leaves and stalk for fodder, and sweet smelling plants. Al-Quran 55:10-12","islamicDay":"16"},
{"month":"Apr","day":6,"Ayah":"To Allah belongs all that is in the heavens and on earth: to Him do all questions go back (for decision). Al-Quran 3:109","islamicDay":"17"},
{"month":"Apr","day":7,"Ayah":"Allah commands justice, the doing of good, and liberality to kith and kin, and He forbids all shameful deeds, and injustice and rebellion: He instructs you that you may receive admonition. Al-Quran 16:90 ","islamicDay":"18"},
{"month":"Apr","day":8,"Ayah":"When the Quran is read, listen to it with attention, and hold your peace: that you may receive Mercy. Al-Quran 7:204","islamicDay":"19"},
{"month":"Apr","day":9,"Ayah":"And do you (O reader) bring your Lord to remembrance in your (very) soul, with humility and in reverence, without loudness in words, in the mornings and evenings; and be not you of those who are unheedful. Al-Quran 7:205","islamicDay":"20"},
{"month":"Apr","day":10,"Ayah":"The mosques of Allah shall be visited and maintained by such as believe in Allah and the Last Day, establish regular prayers, and practice regular charity, and fear none (at all) except Allah. It is they who are expected to be on true guidance. Al-Quran 9:18","islamicDay":"21"},
{"month":"Apr","day":11,"Ayah":"He is Allah, the Creator, the Evolver, the Bestower of Forms (or Colors). To Him belong the Most Beautiful Names: whatever is in the heavens and on earth, doth declare His Praises and Glory: and He is the Exalted in Might, Wise. Al-Quran 59:24","islamicDay":"22"},
{"month":"Apr","day":12,"Ayah":"All who obey Allah and the Messenger are in the company of those on whom is the Grace of Allah,-of the prophets (who teach), the sincere (lovers of Truth), the witnesses (who testify), and the Righteous (who do good): Ah! What a beautiful fellowship! Al-Quran 4:69","islamicDay":"23"},
{"month":"Apr","day":13,"Ayah":"The believers, men and women, are protectors one of another: they enjoin what is just, and forbid what is evil: they observe regular prayers, practice regular charity, and obey Allah and His Messenger. On them will Allah pour His Mercy: For Allah is Exalted in power, Wise. Al-Quran7:71)","islamicDay":"24"},
{"month":"Apr","day":14,"Ayah":"Those who (in charity) spend of their goods by night and by day, in secret and in public, have their reward with their Lord: On them shall be no fear, and nor shall they grieve. Al-Quran 2:274","islamicDay":"25"},
{"month":"Apr","day":15,"Ayah":"Allah will deprive usury of all blessing, but will give increase for deeds of charity: For Allah loves not creatures ungrateful and wicked. Al-Quran 2:276","islamicDay":"26"},
{"month":"Apr","day":16,"Ayah":"If any one does evil or wrongs his own soul but afterwards seeks Allah’s forgiveness, he will find Allah Oft-forgiving, Most Merciful. Al-Quran 4:110","islamicDay":"27"},
{"month":"Apr","day":17,"Ayah":"On no soul does Allah place a burden greater than it can bear. It gets every good that it earns, and it suffers every ill that it earns. (Pray) Our Lord! Condemn us not if we forget or fall into error. Al-Quran 2:286","islamicDay":"28"},
{"month":"Apr","day":18,"Ayah":"(Pray): Our Lord! Lay not us a burden greater than we have strength to bear. Blot out our sins, and grant us forgiveness. Have mercy on us. Thou art our Protector; Help us against those who stand against faith. Al-Quran 2:286)","islamicDay":"29"},
{"month":"Apr","day":19,"Ayah":"If any do deeds of righteousness - be they male or female - and have faith, they will enter Heaven, and not the least injustice will be done to them. Al-Quran 4:124","islamicDay":"30"},
{"month":"Apr","day":20,"Ayah":"Serve Allah and join not any partners with Him: And do good to parents, kinsfolk, orphans, those in need, neighbors who are near, neighbors who are strangers, the companion by your side, the wayfarer (you meet). Al-Quran 4:36","islamicDay":"1"},
{"month":"Apr","day":21,"Ayah":"It is He who made the sun to be a shining glory, and the moon to be a light (of beauty) and measured out stages for her; that you might know the number of years and the count (of time). Al-Quran 10:5","islamicDay":"2"},
{"month":"Apr","day":22,"Ayah":"Allah is He, than Whom there is no other god – the Sovereign, the holy One, the Source of Peace (and Perfection), the Guardian of Faith, the Preserver of Safety, the Exalted in Might, the Irresistible, the Supreme: Glory to Allah! (High is He) above the partners they attribute to Him. Al-Quran 59:23","islamicDay":"3"},
{"month":"Apr","day":23,"Ayah":"It is He who does take your souls by night, and has knowledge of all that you have done by day. By day does He raise you up again that a term appointed be fulfilled; in the end unto Him will be your return. Al-Quran 6:60","islamicDay":"4"},
{"month":"Apr","day":24,"Ayah":"You are the best of peoples, evolved for mankind, enjoining what is right, forbidding what is wrong, and believing in Allah. Al-Quran 3:110","islamicDay":"5"},
{"month":"Apr","day":25,"Ayah":"Those who spend their substance in the cause of Allah, and follow not up their gifts with reminders of their generosity; or with injury, - for them their reward is with their Lord: on them shall be no fear, nor shall they grieve. Al-Quran 2:262","islamicDay":"6"},
{"month":"Apr","day":26,"Ayah":"When you travel through the earth, there is no blame on you if you shorten your prayers. Al-Quran 4:101","islamicDay":"7"},
{"month":"Apr","day":27,"Ayah":"There is no god but He: That is the witness of Allah, His Angels, and those endued with knowledge, standing firm on justice. There is no god but He, the Exalted in Power, the Wise. Al-Quran 3:18","islamicDay":"8"},
{"month":"Apr","day":28,"Ayah":"Those who have faith and do righteous deeds – they are the best of creatures. Their reward is with Allah. Gardens of Eternity, beneath which rivers flow; they will dwell therein forever. Al-Quran 98:7-8","islamicDay":"9"},
{"month":"Apr","day":29,"Ayah":"To those who believe and do deeds of righteousness has Allah promised forgiveness and a great reward. Al-Quran 5:10","islamicDay":"10"},
{"month":"Apr","day":30,"Ayah":"If you would count up the favors of Allah, never would you be able to number them: for Allah is Oft-forgiving, Most Merciful. Al-Quran 16:18","islamicDay":"11"},
{"month":"May","day":1,"Ayah":"The Religion before Allah is Islam (submission to the Will of Allah): Nor did the People of the Book dissent therefrom except through envy of each other, after knowledge had come to them. But if any deny the Signs of Allah, Allah is swift in calling to account. Al-Quran 3:19","islamicDay":"12"},
{"month":"May","day":2,"Ayah":"That which is on earth We have made but as a glittering show for the earth, in order that We may test them as to which of them are best in conduct. Al-Quran 18: 7","islamicDay":"13"},
{"month":"May","day":3,"Ayah":"When My servants ask you concerning Me, I am indeed close to them: I listen to the prayer of every suppliant when he calls on Me Let them also, with a will, listen to My call, and believe in Me: That they may walk in the right way. Al-Quran 2:186","islamicDay":"14"},
{"month":"May","day":4,"Ayah":"It is He who has made the sea subject, that you may eat thereof flesh that is fresh and tender, and that you may extract therefrom ornaments to wear. Al-Quran 16:14","islamicDay":"15"},
{"month":"May","day":5,"Ayah":"O men! Call to mind the Grace of Allah unto you! Is there a creator, other than Allah, to give you sustenance from heaven or earth? There is no God but He: How then are you deluded away from the truth? Al-Quran 35: 3","islamicDay":"16"},
{"month":"May","day":6,"Ayah":"It is He Who brought you forth from the wombs of your mothers when you knew nothing; and He gave you hearing and sight and intelligence and affections: that you may give thanks. Al-Quran 16:78","islamicDay":"17"},
{"month":"May","day":7,"Ayah":"All that they do is noted in (their) books (of deeds): Every matter, small and great, is on record. Al-Quran 54: 52-53","islamicDay":"18"},
{"month":"May","day":8,"Ayah":"Patiently, then persevere: For the promise of Allah is true: and ask forgiveness for your faults, and celebrate the Praises of your Lord in the evening and in the morning. Al-Quran 40:55 ","islamicDay":"19"},
{"month":"May","day":9,"Ayah":"It is Allah who gives Life and Death; and when He decides upon an affair, He says Be and it is. Al-Quran 40:68","IslamicDay":"20"},
{"month":"May","day":10,"Ayah":"Fullfil the Covenant of Allah when you have entered into it, and break not your oaths after you have confirmed them; indeed you have made Allah your surety; for Allah knows all that you do. Al-Quran16:91","islamicDay":"21"},
{"month":"May","day":11,"Ayah":"And render to kindred their due rights, as (also) to those in want, and to the wayfarer: But squander not (your wealth) in the manner of a spendthrift. Al-Quran 17:26","islamicDay":"22"},
{"month":"May","day":12,"Ayah":"Know, therefore, that there is no god but Allah, and ask forgiveness for your fault, and for the men and women who believe: for Allah knows how you move about and how you dwell in your homes. Al-Quran 47:19","islamicDay":"23"},
{"month":"May","day":13,"Ayah":"And among His signs is the creation of the heavens and the earth, and the variations in your languages and your colors: verily in that are Signs for those who know. Al-Quran 30:22","islamicDay":"24"},
{"month":"May","day":14,"Ayah":"If any does good, the reward to him is better than his deeds; but if any does evil, the doer of evil are punished (to the extent of their deeds). Al-Quran 28:84","islamicDay":"25"},
{"month":"May","day":15,"Ayah":"Say: Will you worship, besides Allah, something which has no power either to harm or benefit you? But Allah, - He is that hears and knows all things. Al-Quran 5:76","islamicDay":"26"},
{"month":"May","day":16,"Ayah":"He that does good shall have ten times as much to his credit: he that does evil shall only be recompensed according to his evil: no wrong shall be done unto any of them. Al-Quran 6:160","islamicDay":"27"},
{"month":"May","day":17,"Ayah":"Verily your Lord does provide sustenance in abundance for whom He pleases, and He provides in a just measure. For He does know and regard all His servants. Al-Quran17: 30","islamicDay":"28"},
{"month":"May","day":18,"Ayah":"So have We made the Quran easy in your own tongue, that with it you may give glad tidings to the righteous. And warnings to people given to contention. Al-Quran 19:97","islamicDay":"29"},
{"month":"May","day":19,"Ayah":"It was We who created man, and We know what dark suggestions his soul makes to him: for we are nearer to him than (his) jugular vein. Al-Quran 50:16","islamicDay":"30"},
{"month":"May","day":20,"Ayah":"As to those who turn (for friendship) to Allah, His Apostle and the (fellowship of) believers, it is the fellowship of Allah that must certainly triumph. Al-Quran 5:59","islamicDay":"1"},
{"month":"May","day":21,"Ayah":"Verily this Quran does guide to that which is most right (or stable), and gives the Glad Tidings to the believers who work deeds of righteousness, that they shall have a magnificent reward. Al-Quran 17:09","islamicDay":"2"},
{"month":"May","day":22,"Ayah":"Those who establish regular prayer, and give regular charity, and have (in their hearts) the assurance of the Hereafter, these are on true guidance from their Lord: and these are the ones who will prosper. Al-Quran 31:4-5","islamicDay":"3"},
{"month":"May","day":23,"Ayah":"O Children of Adam! Wear your beautiful apparel at every time and place of prayer: eat and drink: But waste not excess, for Allah loves not the wasters.","islamicDay":"4"},
{"month":"May","day":24,"Ayah":"O you who believe! Seek help with patient perseverance and prayer; for Allah is with those who patiently persevere. Al-Quran 2:153","islamicDay":"5"},
{"month":"May","day":25,"Ayah":"It is He who has made you (His) agents, inheritors of the earth: He has raised you in ranks, some above others: that He may try you in the gifts He has given you: for your Lord is quick in punishment: yet He is indeed Oft-forgiving, Most Merciful. Al-Quran 6:165","islamicDay":"6"},
{"month":"May","day":26,"Ayah":"Our Lord! Pour out on us patience and constancy, and take our souls unto you as Muslims (who bow to your will)! Al-Quran 7:126","islamicDay":"7"},
{"month":"May","day":27,"Ayah":"Our Lord! We have indeed believed: forgive us then our sins and save us from the agony of fire. Al-Quran 3:16","islamicDay":"8"},
{"month":"May","day":28,"Ayah":"Not equal are the blind and those who (clearly) see: Nor are (equal) those who believe and work deeds of righteousness, and those who do evil. Little do you learn by admonition. Al-Quran 40:58","islamicDay":"9"},
{"month":"May","day":29,"Ayah":"Believe in Allah and His messenger, and spend (in charity) out of the (substance) whereof He has made you heirs. For those of you who believe and spend in (charity), - for them is a great reward. Al-Quran 57:07","islamicDay":"10"},
{"month":"May","day":30,"Ayah":"Who is better in speech than one who calls (men) to Allah, works righteousness, and says – I am of those who bows in Islam Al-Quran 41:33","islamicDay":"11"},
{"month":"May","day":31,"Ayah":"O Allah! Lord of Power (and Rule), You give power to whom You please and You strip off power from whom you please: You endow with honor whom You please and You bring low whom You please. In Your hand is all good. Verily over all things You have power. Al-Quran 3:26","islamicDay":"12"},
{"month":"Jun","day":1,"Ayah":"Verily the knowledge of the hour is with Allah (alone). It is He who sends down rain, and He who knows what is in the wombs. Nor does anyone know what it is that he will earn on the morrow. Al-Quran 31:34","islamicDay":"13"},
{"month":"Jun","day":2,"Ayah":"As to those who hold fast by the Book and establish regular prayer, never shall We suffer the reward of the righteous to perish. Al-Quran 7:170","islamicDay":"14"},
{"month":"Jun","day":3,"Ayah":"Behold, two (guardian angels) appointed to learn (his doings) learn (and note them), one sitting on the right and one on the left. Al-Quran 50:17","islamicDay":"15"},
{"month":"Jun","day":4,"Ayah":"O you who believe! Avoid suspicion as much as possible: For suspicion in some cases is a sin: And spy not on each other, nor speak ill of each other behind their backs. Al-Quran 49:12","islamicDay":"16"},
{"month":"Jun","day":5,"Ayah":"O you who believe! Put not yourselves forward before Allah and His Messenger; but fear Allah: for Allah is He Who hears and knows all things. Al-Quran 49:01","islamicDay":"17"},
{"month":"Jun","day":6,"Ayah":"O People of the Book! Commit not excesses in your religion: nor say Allah ought but the truth. Christ Jesus the son of Mary was (no more than) a Messenger of Allah. Al-Quran 4:171","islamicDay":"18"},
{"month":"Jun","day":7,"Ayah":"Abraham was not a Jew nor yet a Christian; but he was true in Faith, and bowed his will to Allahs (which is Islam), and he joined not gods with Allah. Al-Quran 3:67","islamicDay":"19"},
{"month":"Jun","day":8,"Ayah":"Glory to Allah, Who created in pairs all things that the earth produces, as well as their own (human) kind and (other) things of which they have no knowledge. Al-Quran 36:36","islamicDay":"20"},
{"month":"Jun","day":9,"Ayah":"It is He Who sent down tranquility into the hearts of the Believers, that they may add faith to their faith for to Allah belong the Forces of the heavens and the earth and Allah is Full of Knowledge and Wisdom. Al-Quran 48:04","islamicDay":"21"},
{"month":"Jun","day":10,"Ayah":"Whatever is in the heavens and on earth, let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise. Al-Quran 61:01","islamicDay":"22"},
{"month":"Jun","day":11,"Ayah":"And to rehearse the Quran: and if any accept guidance, they do it for the good of your own souls, and if any stray say: I am only a warner. Al-Quran 27:92","islamicDay":"23"},
{"month":"Jun","day":12,"Ayah":"Whatever it be wherein you differ, the decision thereof is with Allah: such is Allah my Lord: In Him I trust, and to Him I turn. Al-Quran 42:10","islamicDay":"24"},
{"month":"Jun","day":13,"Ayah":"On no soul do We place a burden greater than it can bear: before Us is a record which clearly shows the truth: they will never be wronged. Al-Quran 23:62","islamicDay":"25"},
{"month":"Jun","day":14,"Ayah":"We send down (stage by stage) in the Quran that which is a healing and a mercy to those who believe to the unjust it causes nothing but loss after loss. Al-Quran 17:82","islamicDay":"26"},
{"month":"Jun","day":15,"Ayah":"Your Lord knows best who strays from His way: He knows best who they are that receive His guidance. Al-Quran 6: 117","IslamicDay":"27"},
{"month":"Jun","day":16,"Ayah":"As to those who believe and work righteousness, Allah will pay them (in full) their reward but Allah loves not those who do wrong. Al-Quran 3:57","islamicDay":"28"},
{"month":"Jun","day":17,"Ayah":"And Allah sends down rain from the skies, and gives therewith life to the earth and after its death: verily in this is a Sign for those who listen. Al-Quran 16:65","islamicDay":"29"},
{"month":"Jun","day":18,"Ayah":"It is He Who has created for you (the faculties of) hearing, sight, feeling and understanding: little thanks it is you give. Al-Quran 23:78","islamicDay":"30"},
{"month":"Jun","day":19,"Ayah":"Whoever works righteousness benefits his own soul; whoever works evil, it is against his own soul: nor is your Lord ever unjust (in the least) to His servants. Al-Quran 41:46","islamicDay":"1"},
{"month":"Jun","day":20,"Ayah":"The recompense for an injury is an injury equal thereto in degree. But if a person forgives and makes reconciliation, his reward is due from Allah; for Allah loves not those who do wrong. Al-Quran 42:40","islamicDay":"2"},
{"month":"Jun","day":21,"Ayah":"Say: Obey Allah, and obey the Messenger: but if you turn away, he is only responsible for the duty placed on him and you for that placed on you. If you obey, you shall be on right guidance. Al-Quran 24:54","islamicDay":"3"},
{"month":"Jun","day":22,"Ayah":"And Allah most certainly knows those who believe, and as certainly those who are hypocrites. Al-Quran 29:11","islamicDay":"4"},
{"month":"Jun","day":23,"Ayah":"But indeed if any show patience and forgive, that would truly be an exercise of courageous will and resolution in the conduct of affairs. Al-Quran 42:43","islamicDay":"5"},
{"month":"Jun","day":24,"Ayah":"Invite (all) to the Way of your Lord with wisdom and beautiful preaching: and argue with them in ways that are best and most gracious: for your Lord knows best, who have strayed from His Path, and who receive guidance. Al-Quran 16:125)","islamicDay":"6"},
{"month":"Jun","day":25,"Ayah":"O you that believe! Betray not the trust of Allah and the Messenger, nor misappropriate knowingly things entrusted to you. Al-Quran 8:27","islamicDay":"7"},
{"month":"Jun","day":26,"Ayah":"If you loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you forgiveness: for Allah is Most Ready to appreciate (service), Most Forbearing. Al-Quran 64:17","islamicDay":"8"},
{"month":"Jun","day":27,"Ayah":"And Allah has made for you mates (and companions) of your own nature, and made for you, out of them, sons and daughters and grandchildren; and provided for you sustenance of the best. Al-Quran 16:72","islamicDay":"9"},
{"month":"Jun","day":28,"Ayah":"O you who believe! Let not some men among you laugh at others: it may be that the (latter) are better than the (former): Nor let some women laugh at others: It may be that the (latter) are better than the (former). Al-Quran 49:11","islamicDay":"10"},
{"month":"Jun","day":29,"Ayah":"Verily, this is My way, leading straight; follow not (other) paths; they will scatter you about from His (great) path; thus does He command you, that you may be righteous. Al-Quran 6:153","islamicDay":"11"},
{"month":"Jun","day":30,"Ayah":"And those who believe and whose families follow them in faith, to them shall we join their families: Nor shall We deprive them (of the fruit) of any of their works; yet is each individual in pledge for his deeds. Al-Quran 52:21","islamicDay":"12"},
{"month":"Jul","day":1,"Ayah":"And pray in the small watches of the morning: (it would be) an additional prayer (or spiritual profit) for you: soon will your Lord raise you to a station of Praise and Glory! Al-Quran 17:79","islamicDay":"4"},
{"month":"Jul","day":2,"Ayah":"O you who believe! Approach not prayers with a mind befogged, until you can understand all that you say. Al-Quran 4:43","islamicDay":"5"},
{"month":"Jul","day":3,"Ayah":"It is He Who has sent amongst the unlettered a messenger from among themselves, to rehearse to them His Signs, to sanctify them, and to instruct them in Scripture and Wisdom. Al-Quran 62:02","islamicDay":"6"},
{"month":"Jul","day":4,"Ayah":"Then those who believe in Allah, and hold fast to Him, soon will He admit them to Mercy and Grace from Himself, and guide them to Himself by a straight way. Al-Quran 4:175","islamicDay":"7"},
{"month":"Jul","day":5,"Ayah":"Verily Allah knows the secrets of the heavens and the earth: and Allah sees well all that you do. Al-Quran 49:18","islamicDay":"8"},
{"month":"Jul","day":6,"Ayah":"Say: If the whole of mankind and Jinns were to gather together to produce the like of this Quran, they could not produce the like thereof, even if they backed up each other with the help and support.  Al Quran 17: 88 ","islamicDay":"9"},
{"month":"Jul","day":7,"Ayah":"And among his signs is the creation of the heavens and the earth, and the variations in your languages and your colors: verily in that are signs for those who know. Al- Quran 30: 22 ","islamicDay":"10"},
{"month":"Jul","day":8,"Ayah":"As to those who believe and work righteousness, Allah will pay them (in full) their reward; but Allah loves not those who do wrong.  Al-Quran 3: 57 ","islamicDay":"12"},
{"month":"Jul","day":9,"Ayah":"And Allah sends down rain from the skies, and gives therewith life to the earth after its death: verily in this is a sign for those who listen. Al-Quran 16: 65 ","islamicDay":"13"},
{"month":"Jul","day":10,"Ayah":"It is He who has created for you (the faculties of) hearing, sight, feeling and understanding:  Little thanks it is you give. Al-Quran 23: 78 ","islamicDay":"14"},
{"month":"Jul","day":11,"Ayah":"Then those who believe in Allah, and hold fast to Him, soon will He admit them to Mercy and Grace from Himself, and guide them to Himself by a straight way. Al-Quran 4: 175 ","islamicDay":"15"},
{"month":"Jul","day":12,"Ayah":"And be steadfast in patience: for verily Allah will not suffer the reward of the righteous to perish. Al-Quran 11: 115 ","islamicDay":"16"},
{"month":"Jul","day":13,"Ayah":"If anyone withdraws himself from the remembrance of Allah Most Gracious, We appoint for him an evil one, to be his intimate companion to him. Al-Quran 43:36 ","islamicDay":"17"},
{"month":"Jul","day":14,"Ayah":"Recite what is sent of the Book by inspiration to you, and establish regular prayer: for Prayer restrains from shameful and unjust deeds; and remembrance of Allah is the greatest (thing in life) without doubt. And Allah knows the deeds that you do. Al-Quran 29: 45 ","islamicDay":"18"},
{"month":"Jul","day":15,"Ayah":"He is the Living (One); there is no god but He; call  upon Him, giving Him sincere devotion. Praise be to Allah, Lord of the Worlds!  Al-Quran 40: 65","islamicDay":"19"},
{"month":"Jul","day":16,"Ayah":"Verily your Lord does provide sustenance in abundance for whom He pleases, and He provides in a just measure. For He does know and regard all His servants. Al-Quran 17: 30 20 ","islamicDay":"20"},
{"month":"Jul","day":17,"Ayah":"Whoever works righteousness benefits his own soul; whoever works evil, it is against his own soul: nor is your Lord ever unjust (in the least) to His servants. Al-Quran 41: 46 ","islamicDay":"21"},
{"month":"Jul","day":18,"Ayah":"For We had certainly sent unto them a Book (Quran), based on knowledge, which We explained in detail, a guide and a mercy to all who believe. Al-Quran 7: 52 ","islamicDay":"22"},
{"month":"Jul","day":19,"Ayah":"And be steadfast in prayer and regular charity: and whatever good you send forth for your soul before you, you shall find it with Allah. For Allah sees well all that you do. Al-Quran 2: 110 ","islamicDay":"23"},
{"month":"Jul","day":20,"Ayah":"Allah is never unjust in the least degree: if there is any good (done), He doubles it, and gives from His own Presence a great reward. Al-Quran 4:40 ","islamicDay":"24"},
{"month":"Jul","day":21,"Ayah":"Allah, Most Gracious! It is He who has taught the Quran, He has created man: He has taught him speech (and intelligence).  Al-Quran 55: 1-4 ","islamicDay":"25"},
{"month":"Jul","day":22,"Ayah":"Establish regular prayers - at the sun’s decline till the darkness of the night, and the morning prayer and reading: for the prayer and reading in the morning carry their own testimony. Al-Quran 17:78 ","islamicDay":"26"},
{"month":"Jul","day":23,"Ayah":"And know you that your possessions and your progeny are but a trial; and that it is Allah with whom lies your highest reward. Al-Quran 8: 28 ","islamicDay":"27"},
{"month":"Jul","day":24,"Ayah":"And that those on whom knowledge has been bestowed may learn that the Quran is the Truth from your Lord, and that they may believe therein, and their hearts may be made humbly (open) to it. For verily Allah is the Guide of those who believe, to the Straight Way. Al-Quran 22: 54 ","islamicDay":"28"},
{"month":"Jul","day":25,"Ayah":"We send down (stage by stage) in the Quran that which is a healing and a mercy to those who believe: to the unjust it causes nothing but loss after loss. Al-Quran 17: 82 ","islamicDay":"29"},
{"month":"Jul","day":26,"Ayah":"To Allah belongs the East and the West:  wherever you turn, there is the Presence of Allah. For Allah is All-Pervading, All-Knowing. Al Quran 2: 115 ","islamicDay":"30"},
{"month":"Jul","day":27,"Ayah":"Whatever is in the heavens and on earth, does declare the Praises and Glory of Allah. The Sovereign, the Holy One,  the  Exalted in Might, the Wise. Al-Quran 62: 1 ","islamicDay":"1"},
{"month":"Jul","day":28,"Ayah":"Call on your Lord with humility and in private: for Allah loves not those who trespass beyond bounds.   Al-Quran 7: 55 ","islamicDay":"2"},
{"month":"Jul","day":29,"Ayah":"The believers are but a single Brotherhood: so make peace and reconciliation between your two (contending) brothers. Al-Quran 49: 10 ","islamicDay":"3"},
{"month":"Jul","day":30,"Ayah":"O you who believe! Celebrate the praises of Allah, and do this often: and glorify Him morning and evening. Al-Quran 33: 41-42 ","islamicDay":"4"},
{"month":"Jul","day":31,"Ayah":"Allah chooses messengers from angels and from men, for Allah is He who hears and sees (all things). He knows what is before them and what is behind them: and to Allah go back all questions (for decision). Al-Quran 22: 75-76 ","islamicDay":"5"},
{"month":"Aug","day":1,"Ayah":"And recite (and teach) what has been revealed to you of the Book (Quran) of your Lord: none can change His Words, and none will you find as a refuge other than Him. Al-Quran 18: 27 ","islamicDay":"6"},
{"month":"Aug","day":2,"Ayah":"Your (real) friends are (no less than) Allah, His Messenger, and the (fellowship of) believers, - those who establish regular prayers and regular charity and they bow down humbly in (worship). Al-Quran 5: 58 ","islamicDay":"7"},
{"month":"Aug","day":3,"Ayah":"And We send down from the sky rain charged with Blessing, and We produce therewith gardens and grain for harvest. Al-Quran 50:  9 ","islamicDay":"8"},
{"month":"Aug","day":4,"Ayah":"It is He who has sent His Messenger with Guidance and the religion of Truth, to proclaim it over all religion: and enough is Allah for a Witness. Al-Quran 48: 28 ","islamicDay":"9"},
{"month":"Aug","day":5,"Ayah":"O you who believe! When the call is proclaimed to prayer on Friday (the day of Assembly) hasten earnestly to the Remembrance of Allah, and leave off business (and traffic):  that is best for you if you but knew! Al-Quran 62: 9 ","islamicDay":"10"},
{"month":"Aug","day":6,"Ayah":"As to those who believe and work righteousness, verily We shall not suffer to perish the reward of any who do a (single) righteous deed. Al-Quran 18: 30 ","islamicDay":"11"},
{"month":"Aug","day":7,"Ayah":"Say: Call upon Allah, or call upon Rahman: by whatever name you call upon Him, to Him belong the Most Beautiful Names: Neither speak your prayer aloud, nor speak in a low tone, but seek a middle course between.  Al-Quran 17: 110 ","islamicDay":"12"},
{"month":"Aug","day":8,"Ayah":"And pray in the small watches of the morning: (it would be) an additional prayer (or spiritual profit) for you: soon will your Lord raise you to a station of Praise and Glory. Al-Quran 17: 79 ","islamicDay":"13"},
{"month":"Aug","day":9,"Ayah":"O you who believe! Approach not prayer with a mind befogged, until you can understand all that you say. Al-Quran 4: 43 ","islamicDay":"14"},
{"month":"Aug","day":10,"Ayah":"It is Allah who has sent amongst the unlettered an Apostle from among themselves, to rehearse to them His signs, to sanctify them, and to instruct them in scripture and wisdom. Al-Quran 62: 2 ","islamicDay":"15"},
{"month":"Aug","day":11,"Ayah":"O you who believe! If a wicked person comes to you with any news, ascertain the truth, lest you harm people unwittingly and afterwards become full of repentance for what you have done. Al-Quran 49: 6 ","islamicDay":"16"},
{"month":"Aug","day":12,"Ayah":"Verily Allah knows the secrets of the heavens and the earth; and Allah sees well all that you do.   Al Quran 49: 18 ","islamicDay":"17"},
{"month":"Aug","day":13,"Ayah":"Wehave enjoined on man kindness to his parents: in pain did his mother bear him, and in pain did she give him birth. Al-Quran 46: 15 ","islamicDay":"18"},
{"month":"Aug","day":14,"Ayah":"And to every soul will be paid in full (the fruit) of its deeds; and Allah knows best all that they do. Al-Quran 39: 70 ","islamicDay":"19"},
{"month":"Aug","day":15,"Ayah":"O you who believe! Enter not houses other than your own, until you have asked permission and greeted those in them; that is best for you in order that you may heed (what is seemly). Al-Quran 24: 27 ","islamicDay":"20"},
{"month":"Aug","day":16,"Ayah":"And We have explained to man, in this Quran, every kind of similitude: yet the greater part of men refuse (to receive it) except with ingratitude. Al-Quran 17: 89 ","islamicDay":"21"},
{"month":"Aug","day":17,"Ayah":"See you not that Allah sends down rain from the sky, and forthwith the earth becomes clothes with green? For Allah is He Who understands the finest mysteries, and is well-acquainted (with them). Al-Quran 22: 63 ","islamicDay":"22"},
{"month":"Aug","day":18,"Ayah":"Do you not see that to Allah bow down in worship all things that are in the heavens and on earth, the sun, the moon, the stars: the hills, the trees, the animals, and a great number among mankind? Al-Quran 22: 18 ","islamicDay":"23"},
{"month":"Aug","day":19,"Ayah":"As to those who turn (for  friendship) to Allah, His Apostle, and the (fellowship of) believers, it is the fellowship of Allah that must certainly triumph.  Al-Quran 5: 59 ","islamicDay":"24"},
{"month":"Aug","day":20,"Ayah":"To those who believe in Allah and His apostles and make no distinction between any of the apostles, We shall soon give their due rewards;  for Allah is often forgiving, Most merciful. Al-Quran 4: 152 ","islamicDay":"25"},
{"month":"Aug","day":21,"Ayah":"And to all are (assigned) degrees according to the deeds which they (have done), and in order that (Allah) may recompense their deeds, and no injustice be done to them. Al-Quran 46: 19 ","islamicDay":"26"},
{"month":"Aug","day":22,"Ayah":" If a suggestion from Satan assails your (mind), seek refuge with Allah; for He hears and knows (All things). Al-Quran 7: 200 ","islamicDay":"27"},
{"month":"Aug","day":23,"Ayah":"Glorify the name of your Guardian Lord Most High who has created, and further, given order and proportion: Who has ordained Laws and granted guidance; and who brings out the (green and luscious) pasture. Al-Quran 87: 1-4 ","islamicDay":"28"},
{"month":"Aug","day":24,"Ayah":"We have explained in details in this Quran, for the benefit of mankind, every kind of similitude but man is, in most things contentious. Al-Quran 18: 54 ","islamicDay":"29"},
{"month":"Aug","day":25,"Ayah":"When comes the help of Allah, and victory, and you do see the people enter Allah’s religion in crowds; celebrate the praises of your Lord, and pray for his forgiveness, for He is oft-returning (in Grace and Mercy). Al-Quran 110: 1- 3 ","islamicDay":"1"},
{"month":"Aug","day":26,"Ayah":"And Allah is with you wherever you may be. And He sees well what you do. Al-Quran 57:  4 ","islamicDay":"2"},
{"month":"Aug","day":27,"Ayah":"Patiently then persevere: for the Promise of Allah is true and ask for forgiveness for your fault, and celebrate the Praises of your Lord in the evening and in the morning.  Al-Quran 40: 55 ","islamicDay":"3"},
{"month":"Aug","day":28,"Ayah":"Say: Truly my prayer and my service of sacrifice, my life and my death, are (all) for Allah, the Cherisher of the Worlds.  Al-Quran 6:  162  ","islamicDay":"4"},
{"month":"Aug","day":29,"Ayah":"Whatever it be wherein you differ, the decision thereof is with Allah; such is Allah, my Lord.  In Him I trust, and to Him I return. Al-Quran 42: 10 ","islamicDay":"5"},
{"month":"Aug","day":30,"Ayah":"On no soul do We place burden greater than it can bear: before Us is a record which clearly shows the truth: They will never be wronged.  Al-Quran 23: 62 ","islamicDay":"6"},
{"month":"Aug","day":31,"Ayah":"On no soul do We place burden greater than it can bear: before Us is a record which clearly shows the truth: They will never be wronged.  Al-Quran 23: 62 ","islamicDay":"6"},
{"month":"Sep","day":1,"Ayah":"If you disclose (acts of) charity, even so it is well. But if you conceal them, and make them reach those (really) in need that is best for you: It will remove from you some of your (stains) of evil. And Allah is well acquainted with what you do. Al-Quran 2:271 ","islamicDay":"12"},
{"month":"Sep","day":2,"Ayah":"And be steadfast in patience, for verily Allah will not suffer the reward of the righteous to perish. Al-Quran 11:115 ","islamicDay":"13"},
{"month":"Sep","day":3,"Ayah":"Allah it is that has made you the night that you may rest therein, and the day to make you things visible (to you). Verily in this are signs for those who listen (to His Message. Al-Quran 10: 67","islamicDay":"14"},
{"month":"Sep","day":4,"Ayah":"Let there arise out of you a band of people inviting to all that is good, enjoining what is right, and forbidding what is wrong: They are the ones to attain felicity. Al-Quran 3:104","islamicDay":"15"},
{"month":"Sep","day":5,"Ayah":"It is Allah who has spread out the earth for (His) creatures: therein is fruit and date-palms, producing spathes (enclosing dates):  Also corn, with its leaves and stalk for fodder, and sweet smelling plants. Al-Quran 55:10-12","islamicDay":"16"},
{"month":"Sep","day":6,"Ayah":"To Allah belongs all that is in the heavens and on earth: to Him do all questions go back (for decision). Al-Quran 3:109","islamicDay":"17"},
{"month":"Sep","day":7,"Ayah":"Allah commands justice, the doing of good, and liberality to kith and kin, and He forbids all shameful deeds, and injustice and rebellion: He instructs you that you may receive admonition. Al-Quran 16:90 ","islamicDay":"18"},
{"month":"Sep","day":8,"Ayah":"When the Quran is read, listen to it with attention, and hold your peace: that you may receive Mercy. Al-Quran 7:204","islamicDay":"19"},
{"month":"Sep","day":9,"Ayah":"And do you (O reader) bring your Lord to remembrance in your (very) soul, with humility and in reverence, without loudness in words, in the mornings and evenings; and be not you of those who are unheedful. Al-Quran 7:205","islamicDay":"20"},
{"month":"Sep","day":10,"Ayah":"The mosques of Allah shall be visited and maintained by such as believe in Allah and the Last Day, establish regular prayers, and practice regular charity, and fear none (at all) except Allah. It is they who are expected to be on true guidance. Al-Quran 9:18","islamicDay":"21"},
{"month":"Sep","day":11,"Ayah":"He is Allah, the Creator, the Evolver, the Bestower of Forms (or Colors). To Him belong the Most Beautiful Names: whatever is in the heavens and on earth, doth declare His Praises and Glory: and He is the Exalted in Might, Wise. Al-Quran 59:24","islamicDay":"22"},
{"month":"Sep","day":12,"Ayah":"All who obey Allah and the Messenger are in the company of those on whom is the Grace of Allah,-of the prophets (who teach), the sincere (lovers of Truth), the witnesses (who testify), and the Righteous (who do good): Ah! What a beautiful fellowship! Al-Quran 4:69","islamicDay":"23"},
{"month":"Sep","day":13,"Ayah":"The believers, men and women, are protectors one of another: they enjoin what is just, and forbid what is evil: they observe regular prayers, practice regular charity, and obey Allah and His Messenger. On them will Allah pour His Mercy: For Allah is Exalted in power, Wise. Al-Quran7:71)","islamicDay":"24"},
{"month":"Sep","day":14,"Ayah":"Those who (in charity) spend of their goods by night and by day, in secret and in public, have their reward with their Lord: On them shall be no fear, and nor shall they grieve. Al-Quran 2:274","islamicDay":"25"},
{"month":"Sep","day":15,"Ayah":"Allah will deprive usury of all blessing, but will give increase for deeds of charity: For Allah loves not creatures ungrateful and wicked. Al-Quran 2:276","islamicDay":"26"},
{"month":"Sep","day":16,"Ayah":"If any one does evil or wrongs his own soul but afterwards seeks Allah’s forgiveness, he will find Allah Oft-forgiving, Most Merciful. Al-Quran 4:110","islamicDay":"27"},
{"month":"Sep","day":17,"Ayah":"On no soul does Allah place a burden greater than it can bear. It gets every good that it earns, and it suffers every ill that it earns. (Pray) Our Lord! Condemn us not if we forget or fall into error. Al-Quran 2:286","islamicDay":"28"},
{"month":"Sep","day":18,"Ayah":"(Pray): Our Lord! Lay not us a burden greater than we have strength to bear. Blot out our sins, and grant us forgiveness. Have mercy on us. Thou art our Protector; Help us against those who stand against faith. Al-Quran 2:286)","islamicDay":"29"},
{"month":"Sep","day":19,"Ayah":"If any do deeds of righteousness - be they male or female - and have faith, they will enter Heaven, and not the least injustice will be done to them. Al-Quran 4:124","islamicDay":"30"},
{"month":"Sep","day":20,"Ayah":"Serve Allah and join not any partners with Him: And do good to parents, kinsfolk, orphans, those in need, neighbors who are near, neighbors who are strangers, the companion by your side, the wayfarer (you meet). Al-Quran 4:36","islamicDay":"1"},
{"month":"Sep","day":21,"Ayah":"It is He who made the sun to be a shining glory, and the moon to be a light (of beauty) and measured out stages for her; that you might know the number of years and the count (of time). Al-Quran 10:5","islamicDay":"2"},
{"month":"Sep","day":22,"Ayah":"Allah is He, than Whom there is no other god – the Sovereign, the holy One, the Source of Peace (and Perfection), the Guardian of Faith, the Preserver of Safety, the Exalted in Might, the Irresistible, the Supreme: Glory to Allah! (High is He) above the partners they attribute to Him. Al-Quran 59:23","islamicDay":"3"},
{"month":"Sep","day":23,"Ayah":"It is He who does take your souls by night, and has knowledge of all that you have done by day. By day does He raise you up again that a term appointed be fulfilled; in the end unto Him will be your return. Al-Quran 6:60","islamicDay":"4"},
{"month":"Sep","day":24,"Ayah":"You are the best of peoples, evolved for mankind, enjoining what is right, forbidding what is wrong, and believing in Allah. Al-Quran 3:110","islamicDay":"5"},
{"month":"Sep","day":25,"Ayah":"Those who spend their substance in the cause of Allah, and follow not up their gifts with reminders of their generosity; or with injury, - for them their reward is with their Lord: on them shall be no fear, nor shall they grieve. Al-Quran 2:262","islamicDay":"6"},
{"month":"Sep","day":26,"Ayah":"When you travel through the earth, there is no blame on you if you shorten your prayers. Al-Quran 4:101","islamicDay":"7"},
{"month":"Sep","day":27,"Ayah":"There is no god but He: That is the witness of Allah, His Angels, and those endued with knowledge, standing firm on justice. There is no god but He, the Exalted in Power, the Wise. Al-Quran 3:18","islamicDay":"8"},
{"month":"Sep","day":28,"Ayah":"Those who have faith and do righteous deeds – they are the best of creatures. Their reward is with Allah. Gardens of Eternity, beneath which rivers flow; they will dwell therein forever. Al-Quran 98:7-8","islamicDay":"9"},
{"month":"Sep","day":29,"Ayah":"To those who believe and do deeds of righteousness has Allah promised forgiveness and a great reward. Al-Quran 5:10","islamicDay":"10"},
{"month":"Sep","day":30,"Ayah":"If you would count up the favors of Allah, never would you be able to number them: for Allah is Oft-forgiving, Most Merciful. Al-Quran 16:18","islamicDay":"11"},
{"month":"Oct","day":1,"Ayah":"The Religion before Allah is Islam (submission to the Will of Allah): Nor did the People of the Book dissent therefrom except through envy of each other, after knowledge had come to them. But if any deny the Signs of Allah, Allah is swift in calling to account. Al-Quran 3:19","islamicDay":"12"},
{"month":"Oct","day":2,"Ayah":"That which is on earth We have made but as a glittering show for the earth, in order that We may test them as to which of them are best in conduct. Al-Quran 18: 7","islamicDay":"13"},
{"month":"Oct","day":3,"Ayah":"When My servants ask you concerning Me, I am indeed close to them: I listen to the prayer of every suppliant when he calls on Me Let them also, with a will, listen to My call, and believe in Me: That they may walk in the right way. Al-Quran 2:186","islamicDay":"14"},
{"month":"Oct","day":4,"Ayah":"It is He who has made the sea subject, that you may eat thereof flesh that is fresh and tender, and that you may extract therefrom ornaments to wear. Al-Quran 16:14","islamicDay":"15"},
{"month":"Oct","day":5,"Ayah":"O men! Call to mind the Grace of Allah unto you! Is there a creator, other than Allah, to give you sustenance from heaven or earth? There is no God but He: How then are you deluded away from the truth? Al-Quran 35: 3","islamicDay":"16"},
{"month":"Oct","day":6,"Ayah":"It is He Who brought you forth from the wombs of your mothers when you knew nothing; and He gave you hearing and sight and intelligence and affections: that you may give thanks. Al-Quran 16:78","islamicDay":"17"},
{"month":"Oct","day":7,"Ayah":"All that they do is noted in (their) books (of deeds): Every matter, small and great, is on record. Al-Quran 54: 52-53","islamicDay":"18"},
{"month":"Oct","day":8,"Ayah":"Patiently, then persevere: For the promise of Allah is true: and ask forgiveness for your faults, and celebrate the Praises of your Lord in the evening and in the morning. Al-Quran 40:55 ","islamicDay":"19"},
{"month":"Oct","day":9,"Ayah":"It is Allah who gives Life and Death; and when He decides upon an affair, He says Be and it is. Al-Quran 40:68","IslamicDay":"20"},
{"month":"Oct","day":10,"Ayah":"Fullfil the Covenant of Allah when you have entered into it, and break not your oaths after you have confirmed them; indeed you have made Allah your surety; for Allah knows all that you do. Al-Quran16:91","islamicDay":"21"},
{"month":"Oct","day":11,"Ayah":"And render to kindred their due rights, as (also) to those in want, and to the wayfarer: But squander not (your wealth) in the manner of a spendthrift. Al-Quran 17:26","islamicDay":"22"},
{"month":"Oct","day":12,"Ayah":"Know, therefore, that there is no god but Allah, and ask forgiveness for your fault, and for the men and women who believe: for Allah knows how you move about and how you dwell in your homes. Al-Quran 47:19","islamicDay":"23"},
{"month":"Oct","day":13,"Ayah":"And among His signs is the creation of the heavens and the earth, and the variations in your languages and your colors: verily in that are Signs for those who know. Al-Quran 30:22","islamicDay":"24"},
{"month":"Oct","day":14,"Ayah":"If any does good, the reward to him is better than his deeds; but if any does evil, the doer of evil are punished (to the extent of their deeds). Al-Quran 28:84","islamicDay":"25"},
{"month":"Oct","day":15,"Ayah":"Say: Will you worship, besides Allah, something which has no power either to harm or benefit you? But Allah, - He is that hears and knows all things. Al-Quran 5:76","islamicDay":"26"},
{"month":"Oct","day":16,"Ayah":"He that does good shall have ten times as much to his credit: he that does evil shall only be recompensed according to his evil: no wrong shall be done unto any of them. Al-Quran 6:160","islamicDay":"27"},
{"month":"Oct","day":17,"Ayah":"Verily your Lord does provide sustenance in abundance for whom He pleases, and He provides in a just measure. For He does know and regard all His servants. Al-Quran17: 30","islamicDay":"28"},
{"month":"Oct","day":18,"Ayah":"So have We made the Quran easy in your own tongue, that with it you may give glad tidings to the righteous. And warnings to people given to contention. Al-Quran 19:97","islamicDay":"29"},
{"month":"Oct","day":19,"Ayah":"It was We who created man, and We know what dark suggestions his soul makes to him: for we are nearer to him than (his) jugular vein. Al-Quran 50:16","islamicDay":"30"},
{"month":"Oct","day":20,"Ayah":"As to those who turn (for friendship) to Allah, His Apostle and the (fellowship of) believers, it is the fellowship of Allah that must certainly triumph. Al-Quran 5:59","islamicDay":"1"},
{"month":"Oct","day":21,"Ayah":"Verily this Quran does guide to that which is most right (or stable), and gives the Glad Tidings to the believers who work deeds of righteousness, that they shall have a magnificent reward. Al-Quran 17:09","islamicDay":"2"},
{"month":"Oct","day":22,"Ayah":"Those who establish regular prayer, and give regular charity, and have (in their hearts) the assurance of the Hereafter, these are on true guidance from their Lord: and these are the ones who will prosper. Al-Quran 31:4-5","islamicDay":"3"},
{"month":"Oct","day":23,"Ayah":"O Children of Adam! Wear your beautiful apparel at every time and place of prayer: eat and drink: But waste not excess, for Allah loves not the wasters.","islamicDay":"4"},
{"month":"Oct","day":24,"Ayah":"O you who believe! Seek help with patient perseverance and prayer; for Allah is with those who patiently persevere. Al-Quran 2:153","islamicDay":"5"},
{"month":"Oct","day":25,"Ayah":"It is He who has made you (His) agents, inheritors of the earth: He has raised you in ranks, some above others: that He may try you in the gifts He has given you: for your Lord is quick in punishment: yet He is indeed Oft-forgiving, Most Merciful. Al-Quran 6:165","islamicDay":"6"},
{"month":"Oct","day":26,"Ayah":"Our Lord! Pour out on us patience and constancy, and take our souls unto you as Muslims (who bow to your will)! Al-Quran 7:126","islamicDay":"7"},
{"month":"Oct","day":27,"Ayah":"Our Lord! We have indeed believed: forgive us then our sins and save us from the agony of fire. Al-Quran 3:16","islamicDay":"8"},
{"month":"Oct","day":28,"Ayah":"Not equal are the blind and those who (clearly) see: Nor are (equal) those who believe and work deeds of righteousness, and those who do evil. Little do you learn by admonition. Al-Quran 40:58","islamicDay":"9"},
{"month":"Oct","day":29,"Ayah":"Believe in Allah and His messenger, and spend (in charity) out of the (substance) whereof He has made you heirs. For those of you who believe and spend in (charity), - for them is a great reward. Al-Quran 57:07","islamicDay":"10"},
{"month":"Oct","day":30,"Ayah":"Who is better in speech than one who calls (men) to Allah, works righteousness, and says – I am of those who bows in Islam Al-Quran 41:33","islamicDay":"11"},
{"month":"Oct","day":31,"Ayah":"O Allah! Lord of Power (and Rule), You give power to whom You please and You strip off power from whom you please: You endow with honor whom You please and You bring low whom You please. In Your hand is all good. Verily over all things You have power. Al-Quran 3:26","islamicDay":"12"},
{"month":"Nov","day":1,"Ayah":"Verily the knowledge of the hour is with Allah (alone). It is He who sends down rain, and He who knows what is in the wombs. Nor does anyone know what it is that he will earn on the morrow. Al-Quran 31:34","islamicDay":"13"},
{"month":"Nov","day":2,"Ayah":"As to those who hold fast by the Book and establish regular prayer, never shall We suffer the reward of the righteous to perish. Al-Quran 7:170","islamicDay":"14"},
{"month":"Nov","day":3,"Ayah":"Behold, two (guardian angels) appointed to learn (his doings) learn (and note them), one sitting on the right and one on the left. Al-Quran 50:17","islamicDay":"15"},
{"month":"Nov","day":4,"Ayah":"O you who believe! Avoid suspicion as much as possible: For suspicion in some cases is a sin: And spy not on each other, nor speak ill of each other behind their backs. Al-Quran 49:12","islamicDay":"16"},
{"month":"Nov","day":5,"Ayah":"O you who believe! Put not yourselves forward before Allah and His Messenger; but fear Allah: for Allah is He Who hears and knows all things. Al-Quran 49:01","islamicDay":"17"},
{"month":"Nov","day":6,"Ayah":"O People of the Book! Commit not excesses in your religion: nor say Allah ought but the truth. Christ Jesus the son of Mary was (no more than) a Messenger of Allah. Al-Quran 4:171","islamicDay":"18"},
{"month":"Nov","day":7,"Ayah":"Abraham was not a Jew nor yet a Christian; but he was true in Faith, and bowed his will to Allahs (which is Islam), and he joined not gods with Allah. Al-Quran 3:67","islamicDay":"19"},
{"month":"Nov","day":8,"Ayah":"Glory to Allah, Who created in pairs all things that the earth produces, as well as their own (human) kind and (other) things of which they have no knowledge. Al-Quran 36:36","islamicDay":"20"},
{"month":"Nov","day":9,"Ayah":"It is He Who sent down tranquility into the hearts of the Believers, that they may add faith to their faith for to Allah belong the Forces of the heavens and the earth and Allah is Full of Knowledge and Wisdom. Al-Quran 48:04","islamicDay":"21"},
{"month":"Nov","day":10,"Ayah":"Whatever is in the heavens and on earth, let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise. Al-Quran 61:01","islamicDay":"22"},
{"month":"Nov","day":11,"Ayah":"And to rehearse the Quran: and if any accept guidance, they do it for the good of your own souls, and if any stray say: I am only a warner. Al-Quran 27:92","islamicDay":"23"},
{"month":"Nov","day":12,"Ayah":"Whatever it be wherein you differ, the decision thereof is with Allah: such is Allah my Lord: In Him I trust, and to Him I turn. Al-Quran 42:10","islamicDay":"24"},
{"month":"Nov","day":13,"Ayah":"On no soul do We place a burden greater than it can bear: before Us is a record which clearly shows the truth: they will never be wronged. Al-Quran 23:62","islamicDay":"25"},
{"month":"Nov","day":14,"Ayah":"We send down (stage by stage) in the Quran that which is a healing and a mercy to those who believe to the unjust it causes nothing but loss after loss. Al-Quran 17:82","islamicDay":"26"},
{"month":"Nov","day":15,"Ayah":"Your Lord knows best who strays from His way: He knows best who they are that receive His guidance. Al-Quran 6: 117","IslamicDay":"27"},
{"month":"Nov","day":16,"Ayah":"As to those who believe and work righteousness, Allah will pay them (in full) their reward but Allah loves not those who do wrong. Al-Quran 3:57","islamicDay":"28"},
{"month":"Nov","day":17,"Ayah":"And Allah sends down rain from the skies, and gives therewith life to the earth and after its death: verily in this is a Sign for those who listen. Al-Quran 16:65","islamicDay":"29"},
{"month":"Nov","day":18,"Ayah":"It is He Who has created for you (the faculties of) hearing, sight, feeling and understanding: little thanks it is you give. Al-Quran 23:78","islamicDay":"30"},
{"month":"Nov","day":19,"Ayah":"Whoever works righteousness benefits his own soul; whoever works evil, it is against his own soul: nor is your Lord ever unjust (in the least) to His servants. Al-Quran 41:46","islamicDay":"1"},
{"month":"Nov","day":20,"Ayah":"The recompense for an injury is an injury equal thereto in degree. But if a person forgives and makes reconciliation, his reward is due from Allah; for Allah loves not those who do wrong. Al-Quran 42:40","islamicDay":"2"},
{"month":"Nov","day":21,"Ayah":"Say: Obey Allah, and obey the Messenger: but if you turn away, he is only responsible for the duty placed on him and you for that placed on you. If you obey, you shall be on right guidance. Al-Quran 24:54","islamicDay":"3"},
{"month":"Nov","day":22,"Ayah":"And Allah most certainly knows those who believe, and as certainly those who are hypocrites. Al-Quran 29:11","islamicDay":"4"},
{"month":"Nov","day":23,"Ayah":"But indeed if any show patience and forgive, that would truly be an exercise of courageous will and resolution in the conduct of affairs. Al-Quran 42:43","islamicDay":"5"},
{"month":"Nov","day":24,"Ayah":"Invite (all) to the Way of your Lord with wisdom and beautiful preaching: and argue with them in ways that are best and most gracious: for your Lord knows best, who have strayed from His Path, and who receive guidance. Al-Quran 16:125)","islamicDay":"6"},
{"month":"Nov","day":25,"Ayah":"O you that believe! Betray not the trust of Allah and the Messenger, nor misappropriate knowingly things entrusted to you. Al-Quran 8:27","islamicDay":"7"},
{"month":"Nov","day":26,"Ayah":"If you loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you forgiveness: for Allah is Most Ready to appreciate (service), Most Forbearing. Al-Quran 64:17","islamicDay":"8"},
{"month":"Nov","day":27,"Ayah":"And Allah has made for you mates (and companions) of your own nature, and made for you, out of them, sons and daughters and grandchildren; and provided for you sustenance of the best. Al-Quran 16:72","islamicDay":"9"},
{"month":"Nov","day":28,"Ayah":"O you who believe! Let not some men among you laugh at others: it may be that the (latter) are better than the (former): Nor let some women laugh at others: It may be that the (latter) are better than the (former). Al-Quran 49:11","islamicDay":"10"},
{"month":"Nov","day":29,"Ayah":"Verily, this is My way, leading straight; follow not (other) paths; they will scatter you about from His (great) path; thus does He command you, that you may be righteous. Al-Quran 6:153","islamicDay":"11"},
{"month":"Nov","day":30,"Ayah":"And those who believe and whose families follow them in faith, to them shall we join their families: Nor shall We deprive them (of the fruit) of any of their works; yet is each individual in pledge for his deeds. Al-Quran 52:21","islamicDay":"12"},
{"month":"Dec","day":1,"Ayah":"And pray in the small watches of the morning: (it would be) an additional prayer (or spiritual profit) for you: soon will your Lord raise you to a station of Praise and Glory! Al-Quran 17:79","islamicDay":"4"},
{"month":"Dec","day":2,"Ayah":"O you who believe! Approach not prayers with a mind befogged, until you can understand all that you say. Al-Quran 4:43","islamicDay":"5"},
{"month":"Dec","day":3,"Ayah":"It is He Who has sent amongst the unlettered a messenger from among themselves, to rehearse to them His Signs, to sanctify them, and to instruct them in Scripture and Wisdom. Al-Quran 62:02","islamicDay":"6"},
{"month":"Dec","day":4,"Ayah":"Then those who believe in Allah, and hold fast to Him, soon will He admit them to Mercy and Grace from Himself, and guide them to Himself by a straight way. Al-Quran 4:175","islamicDay":"7"},
{"month":"Dec","day":5,"Ayah":"Verily Allah knows the secrets of the heavens and the earth: and Allah sees well all that you do. Al-Quran 49:18","islamicDay":"8"},
{"month":"Dec","day":6,"Ayah":"Say: If the whole of mankind and Jinns were to gather together to produce the like of this Quran, they could not produce the like thereof, even if they backed up each other with the help and support.  Al Quran 17: 88 ","islamicDay":"9"},
{"month":"Dec","day":7,"Ayah":"And among his signs is the creation of the heavens and the earth, and the variations in your languages and your colors: verily in that are signs for those who know. Al- Quran 30: 22 ","islamicDay":"10"},
{"month":"Dec","day":8,"Ayah":"As to those who believe and work righteousness, Allah will pay them (in full) their reward; but Allah loves not those who do wrong.  Al-Quran 3: 57 ","islamicDay":"12"},
{"month":"Dec","day":9,"Ayah":"And Allah sends down rain from the skies, and gives therewith life to the earth after its death: verily in this is a sign for those who listen. Al-Quran 16: 65 ","islamicDay":"13"},
{"month":"Dec","day":10,"Ayah":"It is He who has created for you (the faculties of) hearing, sight, feeling and understanding:  Little thanks it is you give. Al-Quran 23: 78 ","islamicDay":"14"},
{"month":"Dec","day":11,"Ayah":"Then those who believe in Allah, and hold fast to Him, soon will He admit them to Mercy and Grace from Himself, and guide them to Himself by a straight way. Al-Quran 4: 175 ","islamicDay":"15"},
{"month":"Dec","day":12,"Ayah":"And be steadfast in patience: for verily Allah will not suffer the reward of the righteous to perish. Al-Quran 11: 115 ","islamicDay":"16"},
{"month":"Dec","day":13,"Ayah":"If anyone withdraws himself from the remembrance of Allah Most Gracious, We appoint for him an evil one, to be his intimate companion to him. Al-Quran 43:36 ","islamicDay":"17"},
{"month":"Dec","day":14,"Ayah":"Recite what is sent of the Book by inspiration to you, and establish regular prayer: for Prayer restrains from shameful and unjust deeds; and remembrance of Allah is the greatest (thing in life) without doubt. And Allah knows the deeds that you do. Al-Quran 29: 45 ","islamicDay":"18"},
{"month":"Dec","day":15,"Ayah":"He is the Living (One); there is no god but He; call  upon Him, giving Him sincere devotion. Praise be to Allah, Lord of the Worlds!  Al-Quran 40: 65","islamicDay":"19"},
{"month":"Dec","day":16,"Ayah":"Verily your Lord does provide sustenance in abundance for whom He pleases, and He provides in a just measure. For He does know and regard all His servants. Al-Quran 17: 30 20 ","islamicDay":"20"},
{"month":"Dec","day":17,"Ayah":"Whoever works righteousness benefits his own soul; whoever works evil, it is against his own soul: nor is your Lord ever unjust (in the least) to His servants. Al-Quran 41: 46 ","islamicDay":"21"},
{"month":"Dec","day":18,"Ayah":"For We had certainly sent unto them a Book (Quran), based on knowledge, which We explained in detail, a guide and a mercy to all who believe. Al-Quran 7: 52 ","islamicDay":"22"},
{"month":"Dec","day":19,"Ayah":"And be steadfast in prayer and regular charity: and whatever good you send forth for your soul before you, you shall find it with Allah. For Allah sees well all that you do. Al-Quran 2: 110 ","islamicDay":"23"},
{"month":"Dec","day":20,"Ayah":"Allah is never unjust in the least degree: if there is any good (done), He doubles it, and gives from His own Presence a great reward. Al-Quran 4:40 ","islamicDay":"24"},
{"month":"Dec","day":21,"Ayah":"Allah, Most Gracious! It is He who has taught the Quran, He has created man: He has taught him speech (and intelligence).  Al-Quran 55: 1-4 ","islamicDay":"25"},
{"month":"Dec","day":22,"Ayah":"Establish regular prayers - at the sun’s decline till the darkness of the night, and the morning prayer and reading: for the prayer and reading in the morning carry their own testimony. Al-Quran 17:78 ","islamicDay":"26"},
{"month":"Dec","day":23,"Ayah":"And know you that your possessions and your progeny are but a trial; and that it is Allah with whom lies your highest reward. Al-Quran 8: 28 ","islamicDay":"27"},
{"month":"Dec","day":24,"Ayah":"And that those on whom knowledge has been bestowed may learn that the Quran is the Truth from your Lord, and that they may believe therein, and their hearts may be made humbly (open) to it. For verily Allah is the Guide of those who believe, to the Straight Way. Al-Quran 22: 54 ","islamicDay":"28"},
{"month":"Dec","day":25,"Ayah":"We send down (stage by stage) in the Quran that which is a healing and a mercy to those who believe: to the unjust it causes nothing but loss after loss. Al-Quran 17: 82 ","islamicDay":"29"},
{"month":"Dec","day":26,"Ayah":"To Allah belongs the East and the West:  wherever you turn, there is the Presence of Allah. For Allah is All-Pervading, All-Knowing. Al Quran 2: 115 ","islamicDay":"30"},
{"month":"Dec","day":27,"Ayah":"Whatever is in the heavens and on earth, does declare the Praises and Glory of Allah. The Sovereign, the Holy One,  the  Exalted in Might, the Wise. Al-Quran 62: 1 ","islamicDay":"1"},
{"month":"Dec","day":28,"Ayah":"Call on your Lord with humility and in private: for Allah loves not those who trespass beyond bounds.   Al-Quran 7: 55 ","islamicDay":"2"},
{"month":"Dec","day":29,"Ayah":"The believers are but a single Brotherhood: so make peace and reconciliation between your two (contending) brothers. Al-Quran 49: 10 ","islamicDay":"3"},
{"month":"Dec","day":30,"Ayah":"O you who believe! Celebrate the praises of Allah, and do this often: and glorify Him morning and evening. Al-Quran 33: 41-42 ","islamicDay":"4"},
{"month":"Dec","day":31,"Ayah":"Allah chooses messengers from angels and from men, for Allah is He who hears and sees (all things). He knows what is before them and what is behind them: and to Allah go back all questions (for decision). Al-Quran 22: 75-76 ","islamicDay":"5"}
]